upgrade plog ver
